---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Zone.HeatingSetPoint
source: html/badb40e3-19a0-155b-38a0-573c3bcba79f.htm
---
# Autodesk.Revit.DB.Mechanical.Zone.HeatingSetPoint Property

Get or set the Heating Set Point of the Zone.

## Syntax (C#)
```csharp
public double HeatingSetPoint { get; set; }
```

## Remarks
This property is used to get or set the Heating Set Point of the Zone.